{
  "versions": [
    {
      "version": "2.24.0",
      "date": "2025-09-30",
      "type": "minor",
      "title": "Sistema de Áudio, Reações e Respostas",
      "changes": [
        "Correção de falhas no envio de áudios, garantindo compatibilidade e melhor usabilidade.",
        "Adicionados botões de reação e resposta em mensagens de áudio, imagens, vídeos e documentos.",
        "Melhorias na integração com o WhatsApp para suportar respostas e reações de forma estável.",
        "Ajustes visuais para eliminar duplicação de botões em mensagens de mídia.",
        "Otimizações gerais no sistema de mensagens multimídia.",
        "Atualização da documentação com histórico detalhado das mudanças."
      ]
    },
    {
      "version": "2.23.3",
      "date": "2025-09-30",
      "type": "patch",
      "title": "Correções de Reações e Respostas",
      "changes": [
        "Correção de falhas ao reagir a mensagens de áudio no WhatsApp.",
        "Ajustes para que respostas de mensagens funcionem corretamente no WhatsApp.",
        "Correção de falhas que impediam a exibição de respostas do cliente no sistema.",
        "Melhoria na compatibilidade de reações e respostas entre diferentes formatos de mensagem.",
        "Estabilidade do sistema reforçada com registros de monitoramento e debug."
      ]
    },
    {
      "version": "2.23.2",
      "date": "2025-09-29",
      "type": "patch",
      "title": "Correções Finais e Otimizações",
      "changes": [
        "Otimização do sistema de notificações para maior desempenho.",
        "Melhorias de estabilidade em processos internos."
      ]
    },
    {
      "version": "2.23.1",
      "date": "2025-09-29",
      "type": "patch",
      "title": "Correções de Estabilidade",
      "changes": [
        "Correção de instabilidades no módulo de áudio.",
        "Otimização do sistema de transferências realizadas pela IA."
      ]
    },
    {
      "version": "2.23.0",
      "date": "2025-09-27",
      "type": "minor",
      "title": "Nova IA Multimídia e Sistema CSAT",
      "changes": [
        "Nova capacidade da IA para processar áudios e imagens.",
        "Implementação de pesquisa de satisfação do cliente (CSAT).",
        "Inclusão de novos efeitos sonoros para notificações.",
        "Exibição da foto do contato diretamente na aba de auditoria.",
        "Otimizações no sistema de transferências por IA.",
        "Correções no sistema de notificações para maior confiabilidade."
      ]
    },
    {
      "version": "2.22.0",
      "date": "2025-09-26",
      "type": "minor",
      "title": "Sistema CSAT e Melhorias Iniciais",
      "changes": [
        "Primeira versão do sistema de pesquisa de satisfação (CSAT).",
        "Primeira versão da IA com suporte a áudios e imagens.",
        "Otimizações iniciais nas transferências realizadas pela IA.",
        "Correções no sistema de áudio para maior estabilidade."
      ]
    },
    {
      "version": "2.21.0",
      "date": "2025-09-26",
      "type": "minor",
      "title": "Base para Novas Funcionalidades",
      "changes": [
        "Adição de recursos fundamentais para suportar futuras funcionalidades.",
        "Compatibilidade reforçada com versões anteriores."
      ]
    },
    {
      "version": "2.20.13",
      "date": "2025-09-26",
      "type": "patch",
      "title": "Correções de Estabilidade",
      "changes": [
        "Ajustes e melhorias gerais para maior confiabilidade."
      ]
    },
    {
      "version": "2.20.12",
      "date": "2025-09-23",
      "type": "patch",
      "title": "Correções e Melhorias",
      "changes": [
        "Correções de problemas menores e melhorias de estabilidade."
      ]
    },
    {
      "version": "2.20.11",
      "date": "2025-09-21",
      "type": "patch",
      "title": "Correções e Melhorias",
      "changes": [
        "Correções de falhas pontuais e melhorias de desempenho."
      ]
    },
    {
      "version": "2.20.10",
      "date": "2025-09-21",
      "type": "patch",
      "title": "Correções e Melhorias",
      "changes": [
        "Correções de estabilidade em processos de atendimento e notificações."
      ]
    }
  ]
}